<template>
  	<div class="wrapper">
        <div class="component">
            <h2>高校</h2>
            <p>高校が掲げた目標である「文武両道」を目指し、勉強と部活動の両立に力を入れて生活をしました。勉強は主に復習に力を入れ、成績上位をキープしました。部活動はフェンシング部に所属し、部長として部を牽引しました。全国大会に出場した経験もあります。情報系に興味を持ち始めたきっかけは、高校2年生の冬に観たアニメ「プラスティック・メモリーズ」で、人間と人工知能の共生に可能性を感じました。</p>
        </div>
        <div class="component">
            <h2>大学</h2>
            <p>大学の講義、教職課程、部活動、アルバイトと忙しい日々でしたが、タスクマネジメントに力を入れて生活をしました。大学の成績は上位をキープし、希望の専攻に配属されることができました。教職課程では、中学数学、高校数学、高校情報の教員免許を取得しました。部活動では種目長を務め、全国大会団体3位などの成績を収めました。アルバイトでは個別進学塾の講師を約3年間務め、生徒の成績アップや、希望の進路実現を達成することができました。B4からは研究室に配属され、研究に従事しました。</p>
        </div>
        <div class="component">
            <h2>大学院</h2>
            <p>大学院の講義、教職課程、研究、ゼミ、就職活動とやることがたくさんありますが、早めの行動を心がけて生活しています。研究も本格的になり、学会発表も経験しました。また、フロントエンド系のプログラミング言語についても本格的に勉強を始めました。今後は実践的な開発と、就職活動を頑張りたいと考えています。</p>
        </div>
  	</div>
</template>

<script>
</script>

<style scoped>
.wrapper {
	text-align: center;
	animation: fadein 3s forwards;
}

@keyframes fadein {
	0% {
		opacity: 0;
	}
	100% {
		opacity: 1;
  }
}

.component {
    background-color: whitesmoke;
    width: 100%;
    border-radius: 10px;
}
</style>